app/controllers/systems_controller.rb

  def index
    @systems = System.all
---
SELECT * FROM "systems" ORDER BY make

  def show
    @system = System.find(params[:id])
---
SELECT * FROM "systems" WHERE ("systems"."id" = 1)

  def create
    @system = System.new(params[:system])
    if @system.save
---
INSERT INTO "systems" ("Barcode", "Hard_Drive_Capacity_GB", "updated_at", "Model", "Owner_Phone", "Make", "Aquired_Date", "Owner_Full_Name", "Owner_Email", "CPU_Family", "CPU_Clock_Speed", "RAM_Amount_MB", "created_at") VALUES(123456, '80', '2009-05-23 07:09:54', 'Aspire 3680', 18885555555, 'Acer', '2009-05-23', 'Darren VanBuren', 'onekopaka@gmail.com', 'Intel Celeron Mobile', '1.87 Ghz', 2048, '2009-05-23 07:09:54')

  def edit
    @system = System.find(params[:id])
---
SELECT * FROM "systems" WHERE ("systems"."id" = 1)

  def update
    @system = System.find(params[:id])
    if @system.update_attributes(params[:system])
---
SELECT * FROM "systems" WHERE ("systems"."id" = 2)
UPDATE "systems" SET "Owner_Phone" = 4253361435, "Barcode" = 1, "updated_at" = '2009-09-15 05:35:27' WHERE "id" = 5

  def find_by_barcode
    @system = System.find_by_Barcode(params[:id])
---
SELECT * FROM "systems" WHERE ("systems"."Barcode" = '123456') LIMIT 1